Documents/Enhancements-Nov2017/DueDiligenceWebServices/ForAnalysis/DDAStoiSprintRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:init="http://www.iconplc.com/InitiateDDASiSprintFindings/xsd/v3/initiateDDASiSprintFindingsMsg" xmlns:edh="http://edh.esb.iconplc.com">
   <soapenv:Header/>
   <soapenv:Body>
      <init:DueDiligenceiSprintRequest>
         <init:header>
            <init:sender>sri</init:sender>
            <init:timestamp>2017-08-20T11:06:25.000Z</init:timestamp>
            <init:message_id>sri1</init:message_id>
         </init:header>
         <!--Optional:-->
         <init:DDResults>
            <edh:project>
               <edh:projectNumber>9002</edh:projectNumber>
               <!--Optional:-->
               <edh:sponsorProtocolNumber>202</edh:sponsorProtocolNumber>
            </edh:project>
            <edh:institutuions>
               <!--Optional:-->
               <edh:checksCompleted>
                  <!--1 or more repetitions:-->
                  <edh:check>
                     <edh:name>institution world check</edh:name>
                     <edh:date>2017-08-20</edh:date>
                  </edh:check>
               </edh:checksCompleted>
               <edh:instituteComplianceIssue>true</edh:instituteComplianceIssue>
               <!--Optional:-->
               <edh:ddFindings>
                  <!--1 or more repetitions:-->
                  <edh:finding>
                     <edh:date>2017-08-20</edh:date>
                     <edh:type>Regulatory</edh:type>
                     <edh:regulatoryCode>OAI</edh:regulatoryCode>
                     <edh:regulatoryDeficiency>No</edh:regulatoryDeficiency>
                     <edh:worldCheckFinding>No</edh:worldCheckFinding>
                     <edh:comment>Test123</edh:comment>
                  </edh:finding>
               </edh:ddFindings>
            </edh:institutuions>
            <edh:investigatorResults>
               <!--1 or more repetitions:-->
               <edh:investigatorResult>
                  <edh:investigatorId>101010</edh:investigatorId>
                  <!--Optional:-->
                  <edh:memberId>101010</edh:memberId>
                  <edh:firstName>Srinivas</edh:firstName>
                  <!--Optional:-->
                  <edh:middleName>A</edh:middleName>
                  <edh:lastName>Suri</edh:lastName>
                  <edh:ddStatus>Available</edh:ddStatus>
                  <!--Optional:-->
                  <edh:ddCompletedDate>2017-08-20</edh:ddCompletedDate>
                  <!--Optional:-->
                  <edh:checksCompleted>
                     <!--1 or more repetitions:-->
                     <edh:check>
                        <edh:name>investigator world check</edh:name>
                        <edh:date>2017-08-20</edh:date>
                     </edh:check>
                  </edh:checksCompleted>
                  <!--Optional:-->
                  <edh:dmc9002CheckDate>2017-08-20</edh:dmc9002CheckDate>
                  <!--Optional:-->
                  <edh:dmc9002Exclusion>Exclusion</edh:dmc9002Exclusion>
                  <!--Optional:-->
                  <edh:ddFindings>
                     <!--1 or more repetitions:-->
                     <edh:finding>
                        <edh:date>2017-08-20</edh:date>
                        <edh:type>Regulatory</edh:type>
                        <edh:regulatoryCode>OAI</edh:regulatoryCode>
                        <edh:regulatoryDeficiency>No</edh:regulatoryDeficiency>
                        <edh:worldCheckFinding>No</edh:worldCheckFinding>
                        <edh:comment>TestingInv</edh:comment>
                     </edh:finding>
                  </edh:ddFindings>
               </edh:investigatorResult>
            </edh:investigatorResults>
         </init:DDResults>
      </init:DueDiligenceiSprintRequest>

   </soapenv:Body>
</soapenv:Envelope>